app/controllers/comments_controller.rb

	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["body", "xzczczxc"], ["commenter", "xzczxcz"], ["created_at", "2014-07-14 20:17:33.100199"], ["updated_at", "2014-07-14 20:17:33.100199"]]