app/controllers/emails_controller.rb

    def show
    	@email = Email.find(params[:id])
---
SELECT  "emails".* FROM "emails"  WHERE "emails"."id" = ? LIMIT 1  [["id", 0]]

    def index
       @emails = Email.all
---
SELECT "emails".* FROM "emails"